{"count":2,"ids":{"c6b055378e5ccd97873565152bfcf6e4c649e4c221f92d7ce169ab1b398f12a0":{"date":"1639698318174","from":"it@mompopsflags.com","message":"Hi Pop,\n\nI can reset your password, but it cannot be reset to any of the passwords that you have sent me.\n\nI cannot use passwords that were publicly sent over the internet, since it is highly likely that they could be breached. However, I do admit that the passwords I've been giving you are probably too complicated. I can make a simpler password that is equally secure, but much easier for you and Mom to remember.\n\nI can drive down to the shop this Saturday to tell you your new password in-person. Sorry that you will have to wait to log into your other devices.\n\nTalk to you soon,\nEmilia\n\nPS. My parents might be there as your shop is between destinations for us.","subject":"Re: Password has been forgotten HELP","to":"admin@mompopsflags.com"},"d1f592f82d64ab275f7661c4e3d40cd3860c7381e2fd34295fec02dd4b41987f":{"date":"1639798225627","from":"friends@omniflag.net","message":"Hello Mom and Pop,\n\nWe are pleased to hear that flag sales have been growing at an exponential rate. As previously discussed, this is one of the benefits to joining our company.\n\nWe wish to inform you that a new shipment of flags will be coming in very soon.\n\nTo get to the point, one of the flags that we have obtained is:\n - magpie{@u+h0r1z@+10n_2_l@x}\n\nYou likely understand the value of these flags and understand the gravity of the situation.\n\nGreat sacrifices have been made to retrieve these flags, and unfortunately we did not leave unnoticed. With the great notoriety these flags pocess, we must ask you to store these flags for us. We apologize for any inconvenience this may bring, but refusal is would be a breach in our contract.\n\nPlease have your IT intern develop a secure storage system for these flags. The provided flag should be more than enough for her to work with.\n\nThank you for your compliance.\n\nSincerely,\nYour friends at Omni-Flag\n\nOmni-Flag: A Family Company","subject":"[Urgent] New Flag Shipment","to":"admin@mompopsflags.com"}}}
